'''
ans = []
for x in range(100,1000):
    if x%10 ==0:
        continue
    rx = int(str(x)[::-1])
    y = x+rx
    if sum(1 if int(c)%2==0 else 0 for c in str(y)) == 0:
        ans +=[x]
        
print(ans)
print(len(ans))
'''

'''
要分奇数位数，偶数位数讨论
对偶数位数，考虑中间的 [n//2-1]+[n//2]，若和>10有进位，则其和必须是偶数，
=> [n//2-2]+[n//2+1],必须进位切和必须是偶数=>...=> [1]+[n-1]是偶数，显然不和条件。所以中间两位必然没进位，则和为奇数，
则所有的数均为和为奇数无进位
不进位奇数和
(1,2)(1,4)(1,6)(1,8)(2,3)(2,5)(2,7)(3,4)(3,6)(4,5) 中间位还可有(0,1)(0,3)(0,5)(0,7)(0,9)
即首尾位有20种组合，非首尾位有30种组合

对奇数位数，由于中间[n//2]+[n//2]必然是偶数，若中间位进位，则同偶数位的分析，无解。当len(n) % 4 = 1时，无解，当len(n) % 4 = 3时有解，解的形式为
abababa 其中b为逆序求和不进位的偶数和，a是逆序求和进位的奇数和
不进位偶数和
(0,0)(0,2)(0,4)(0,6)(0,8)(1,1)(1,3)(1,5)(1,7)(2,2)(2,4)(2,6)(3,3)(3,5)(4,4)
b非中间位有25种组合，b中间位有5种组合
进位奇数和
(2,9)(3,8)(4,7)(4,9)(5,6)(5,8)(6,7)(6,9)(7,8)(8,9)
a位有20种组合

'''



def cal144(n):
    if n%2 == 0:
        return 20*30**(n//2-1)
    elif n%4 == 3:
        return 5*25**(n//4)*20**(n//4+1)
    else:
        return 0


thrd = 9
s = 0
for n in range(1,thrd+1):
    s += cal144(n)
    
print(s)
    
    
